app/views/diners/_form.html.haml

      %div.controls
        = check_box_tag "diner[mealtype_ids][]", mealtype.id, @diner.mealtypes.include?(mealtype)
---
SELECT "mealtypes".id FROM "mealtypes" INNER JOIN "diners_mealtypes" ON "mealtypes"."id" = "diners_mealtypes"."mealtype_id" WHERE "diners_mealtypes"."diner_id" IS NULL
SELECT 1 AS one FROM "mealtypes" INNER JOIN "diners_mealtypes" ON "mealtypes"."id" = "diners_mealtypes"."mealtype_id" WHERE "diners_mealtypes"."diner_id" IS NULL AND "mealtypes"."id" = 1 LIMIT 1