app/views/diners/_form.html.haml

    = f.label "Art des Diners"
    = f.collection_select :diner_type_id, DinerType.all, :id, :name, { selected: @diner.diner_type_id }, { multiple: false }
  .field
---
SELECT "diner_types".* FROM "diner_types"