app/views/diners/index.html.haml

SELECT "diner_types".* FROM "diner_types" ORDER BY name ASC
---
      %option{:value => "-1"} Wähle eine Dinerart
      - d = DinerType.order('name ASC').all