app/views/diners/show.html.haml

SELECT "mealtypes".* FROM "mealtypes" INNER JOIN "diners_mealtypes" ON "mealtypes"."id" = "diners_mealtypes"."mealtype_id" WHERE "diners_mealtypes"."diner_id" = 5
---
  %b Art der Gerichte:
  - @diner.mealtypes.each do |mealtype|