app/views/events/_form.html.haml

SELECT "diners".* FROM "diners"
---
    %div.controls
    = f.collection_select :diner_id, Diner.all, :id, :name, { selected: @event.diner_id }, { multiple: false }