app/views/events/index.html.haml

      %td= event.dtime.strftime("%H:%M")
      %td= event.users.count
      %td
        - if event.users.include?(current_user)
---
SELECT COUNT(*) FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = 1
SELECT 1 AS one FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = 1 AND "users"."id" = 1 LIMIT 1