app/views/events/show.html.haml

%p
  - if can?(:update, @event) and !@event.users.include?(current_user)
---
SELECT "users".* FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = 1
SELECT 1 AS one FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = 1 AND "users"."id" = 1 LIMIT 1