app/controllers/diners_controller.rb

SELECT "diners".* FROM "diners" ORDER BY name ASC LIMIT 25 OFFSET 0
---
  def index
    @diners = Diner.type_search(params[:type_search]).page(params[:page]).order('name ASC')