app/controllers/diners_controller.rb

  def index
    @diners = Diner.all
---
SELECT "diners".* FROM "diners"

  def show
    @diner = Diner.find(params[:id])
---
SELECT "diners".* FROM "diners" WHERE "diners"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @diner = Diner.find(params[:id])
---
SELECT "diners".* FROM "diners" WHERE "diners"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    params[:diner][:mealtype_ids] ||=[]
    @diner = Diner.find(params[:id])

    respond_to do |format|
      if @diner.update_attributes(params[:diner])
---
SELECT "diners".* FROM "diners" WHERE "diners"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "diners" SET "diner_type_id" = 1, "updated_at" = '2013-01-03 22:30:48.688952' WHERE "diners"."id" = 5

  def destroy
    @diner = Diner.find(params[:id])
    @diner.destroy
---
SELECT "diners".* FROM "diners" WHERE "diners"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "diners" WHERE "diners"."id" = ?  [["id", 1]]