app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (date(dtime) = '2013-02-26') ORDER BY dtime ASC

  def create
    @event.user = current_user
    @event.users << current_user
---
INSERT INTO "events" ("created_at", "diner_id", "dtime", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 18 Jan 2013 12:32:53 UTC +00:00], ["diner_id", 5], ["dtime", Fri, 18 Jan 2013 12:32:00 UTC +00:00], ["updated_at", Fri, 18 Jan 2013 12:32:53 UTC +00:00], ["user_id", 3]]

  def participate
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]